{"formerly":"M0346 N0130","seq":"1,1,2,2,5,4,7,7,11,9,8,6,9,4,6,22,10,4,8,4,9,4,7,5,28,7,15,14,8,4,12,7,4,2,6,22,11,4,2,8,10,4,10,4,9,2,6,4,40,9,2,3,8,4,8,9,5,2,6,9,14,4,8,74,13,7,10,7,2,2,10,4,16,4,2,2,4,6,10,4,155,10,6,6,6,2,2,2,10,4,10,2","description":"Number of primitive permutation groups of degree n.","comments":"A check found errors in Theißen's data (degree 121 and 125) as well as in Short's work (degree 169). - Alexander Hulpke (hulpke(AT)math.colostate.edu), Feb 19 2002There is an error at n=574 in the Dixon-Mortimer paper. - Colva M. Roney-Dougal.","references":["CRC Handbook of Combinatorial Designs, 1996, pp. 595ff.","K. Harada and H. Yamaki, The irreducible subgroups of GL_n(2) with n <= 6, C. R. Math. Rep. Acad. Sci. Canada 1, 1979, 75-78.","A. Hulpke, Konstruktion transitiver Permutationsgruppen, Dissertation, RWTH Aachen, 1996.","J. Labelle and Y. N. Yeh, The relation between Burnside rings and combinatorial species, J. Combin. Theory, A 50 (1989), 269-284. See page 280.","M. W. Short, The Primitive Soluble Permutation Groups of Degree less than 256, LNM 1519, 1992, Springer","C. C. Sims, Computational methods in the study of permutation groups, pp. 169-183 of J. Leech, editor, Computational Problems in Abstract Algebra. Pergamon, Oxford, 1970.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence).","H. Theißen, Eine Methode zur Normalisatorberechnung in Permutationsgruppen mit Anwendungen in der Konstruktion primitiver Gruppen, Dissertation, RWTH, RWTH-A, 1997 [But see comment above about errors! ]"],"links":["N. J. A. Sloane, <a href=\"/A000019/b000019.txt\">Table of n, a(n) for n=1..2499</a> [Computed using the GAP command shown below, which uses the results of Colva M. Roney-Dougal]","J. D. Dixon and B. Mortimer, <a href=\"http://dx.doi.org/10.1017/S0305004100064793\">The primitive permutation groups of degree less than 1000</a>, Math. Proc. Cambridge Philos. Soc., 103, 213-238, 1988 [But see comment above about errors! ]","A. Hulpke, <a href=\"http://www.math.colostate.edu/~hulpke/smalldeg.html\">Transitive groups of small degree</a>","A. Hulpke, <a href=\"http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.73.5038\">Constructing transitive permutation groups</a>, J. Symbolic Comput. 39 (2005), 1-30.","C. C. Sims, <a href=\"/A000019/a000019.pdf\">Letter to N. J. A. Sloane (no date)</a>","<a href=\"/index/Gre#groups\">Index entries for sequences related to groups</a>","<a href=\"/index/Cor#core\">Index entries for \"core\" sequences</a>"],"prog":"(GAP) List([2..2499],NrPrimitiveGroups);(MAGMA) [NumberOfPrimitiveGroups(i) : i in [1..999]];","crossrefs":["Cf. A000001, A023675, A023676, A000638, A002106, A005432, A000637."],"keyword":"nonn,core,nice","offset":"1,3","author":"_N. J. A. Sloane_","extensions":["More terms and additional references from Alexander Hulpke (Alexander.Hulpke(AT)Math.RWTH-Aachen.DE)"]}