{"formerly":"M0819 N0310 N1026","seq":"1,2,3,6,22,402,1228158,400507806843728,527471432057653004017274030725792,11218076601767519586965281984173341005925142853855481024470471657123840","description":"a(-1)=1 by convention; for n >= 0, a(n) = number of irreducible Boolean functions of n variables.","comments":"Number of NP-equivalence classes of switching functions of n or fewer variables.Number of inequivalent binary nonlinear codes of length n (and all sizes).a(n+1) = number of NPN-equivalence classes of canalizing functions (see A102449) with n variables. NPN-equivalence allows complementing the function value as well as the individual variables. E.g., the 6 inequivalent canalizing functions when n=3 are 0, x, x AND y, x AND y AND z, x AND (y OR z), x AND (y XOR z). - _Don Knuth_, Aug 24 2005, Aug 06 2006","references":["F. Harary and E. M. Palmer, Graphical Enumeration, Academic Press, NY, 1973, p. 112.","M. A. Harrison, The number of transitivity sets of Boolean functions, J. Soc. Indust. Appl. Math., 11 (1963), 806-828.","M. A. Harrison, Introduction to Switching and Automata Theory. McGraw Hill, NY, 1965, p. 149.","D. E. Knuth, The Art of Computer Programming, Vol. 4A, Section 7.1.1, p. 79.","S. Muroga, Threshold Logic and Its Applications. Wiley, NY, 1971, p. 38, Table 2.3.2. - Row 11.","J. Sklansky, General synthesis of tributary switching networks, IEEE Trans. Elect. Computers, 12 (1963), 464-469.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence).","I. Toda, On the number of types of self-dual logical functions, IEEE Trans. Electron. Comput., 11 (1962), 282-284.","I. Tomescu, Introducere in Combinatorica. Editura Tehnica, Bucharest, 1972, p. 129."],"links":["Marcus Ritt, <a href=\"/A000616/b000616.txt\">Table of n, a(n) for n = -1..10</a>","B. Elspas, <a href=\"/A000610/a000610.pdf\">Self-complementary symmetry types of Boolean functions</a>,  IEEE Transactions on Electronic Computers 2, no. EC-9 (1960): 264-266. [Annotated scanned copy]","S. Muroga, <a href=\"/A000371/a000371.pdf\">Threshold Logic and Its Applications</a>, Wiley, NY, 1971 [Annotated scans of a few pages]","S. Muroga, T. Tsuboi and C. R. Baugh, <a href=\"/A002077/a002077.pdf\">Enumeration of threshold functions of eight variables</a>, IEEE Trans. Computers, 19 (1970), 818-825. [Annotated scanned copy]","I. Toda, <a href=\"/A001531/a001531.pdf\">On the number of types of self-dual logical functions</a> (annotated scanned copy)","<a href=\"/index/Bo#Boolean\">Index entries for sequences related to Boolean functions</a>"],"formula":"Harrison gives a simple formula in terms of the cycle index of the appropriate group.","crossrefs":["Row sums of A039754.","Cf. A102449, A109460, A109462."],"keyword":"nonn,easy,nice","offset":"-1,2","author":"_N. J. A. Sloane_","extensions":["More terms from _Vladeta Jovovic_","Entry revised by _N. J. A. Sloane_, Aug 07 2006","Terms a(9) and a(10) (given in b-file) from _Marcus Ritt_, Aug 13 2013"]}