{"formerly":"M4136 N1836","seq":"6,20,52,108,211,388,664,1045,1617,2510,3607,5118,7066,9748,12793,17061,22342,28874,36560,45745,57814,72997,87555,106888,129783","description":"a(n) = solution to the postage stamp problem with 6 denominations and n stamps.","comments":"_Fred Lunnon_ [W. F. Lunnon] defines \"solution\" to be the smallest value not obtainable by the best set of stamps. The solutions given are one lower than this, that is, the sequence gives the largest number obtainable without a break using the best set of stamps.","references":["R. Alter and J. A. Barnett, A postage stamp problem, Amer. Math. Monthly, 87 (1980), 206-210.","R. K. Guy, Unsolved Problems in Number Theory, C12.","W. F. Lunnon, A postage stamp problem. Comput. J. 12 (1969) 377-380.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["M. F. Challis, <a href=\"http://dx.doi.org/10.1093/comjnl/36.2.117\">Two new techniques for computing extremal h-bases A_k</a>, Comp. J. 36(2) (1993) 117-126","Erich Friedman, <a href=\"http://www.stetson.edu/%7Eefriedma/mathmagic/0403.html\">Postage stamp problem</a>","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/PostageStampProblem.html\">Postage stamp problem</a>","M. F. Challis and J. P. Robinson, <a href=\"http://www.cs.uwaterloo.ca/journals/JIS/VOL13/Challis/challis6.html\">Some Extremal Postage Stamp Bases</a>, J. Integer Seq., 13 (2010), Article 10.2.3. [From John P Robinson (john-robinson(AT)uiowa.edu), Feb 18 2010]"],"crossrefs":["Postage stamp sequences: A001208 A001209 A001210 A001211 A001212 A001213 A001214 A001215 A001216 A005342 A005343 A005344 A014616 A053346 A053348 A075060 A084192 A084193","A row or column of the array A196416 (possibly with 1 subtracted from it)."],"keyword":"nonn","offset":"1,1","author":"_N. J. A. Sloane_.","extensions":["Added terms up to a(15) from Challis. - _R. J. Mathar_, Apr 01 2006","Entry improved by comments from John Seldon (johnseldon(AT)onetel.com), Sep 15 2004","Added terms a(16) through a(25) from Challis and Robinson. John P Robinson (john-robinson(AT)uiowa.edu), Feb 18 2010"]}