{"formerly":"M0116 N0046 N0287","seq":"1,2,1,2,3,6,9,18,30,56,99,186,335,630,1161,2182,4080,7710,14532,27594,52377,99858,190557,364722,698870,1342176,2580795,4971008,9586395,18512790,35790267,69273666,134215680,260300986,505286415,981706806,1908866960,3714566310,7233615333,14096302710,27487764474","description":"Number of degree-n irreducible polynomials over GF(2); number of n-bead necklaces with beads of 2 colors when turning over is not allowed and with primitive period n; number of binary Lyndon words of length n.","comments":"Also dimensions of free Lie algebras - see A059966, which is essentially the same sequence.This sequence also represents the number N of cycles of length L in a digraph under x^2 seen modulo a Mersenne prime M_q=2^q-1. This number does not depend on q and L is any divisor of q-1. See Theorem 5 and Corollary 3 of the Shallit and Vasiga paper: N=sum(eulerphi(d)/order(d,2)) where d is a divisor of 2^(q-1)-1 such that order(d,2)=L. - Tony Reix (Tony.Reix(AT)laposte.net), Nov 17 2005Except for a(0) = 1, Bau-Sen Du's [1985/2007] Table 1, p. 6, has this sequence as the 7th (rightmost) column. Other columns of the table include (but are not identified as) A006206-A006208. - _Jonathan Vos Post_, Jun 18 2007\"Number of binary Lyndon words\" means: number of binary strings inequivalent modulo rotation (cyclic permutation) of the digits and not having a period smaller than n. This provides a link to A103314, since these strings correspond to the inequivalent zero-sum subsets of U_m (m-th roots of unity) obtained by taking the union of U_n (n|m) with 0 or more U_d (n | d, d | m) multiplied by some power of exp(i 2Pi/n) to make them mutually disjoint. (But not all zero-sum subsets of U_m are of that form.) - _M. F. Hasler_, Jan 14 2007Also the number of dynamical cycles of period n of a threshold Boolean automata network which is a quasi-minimal positive circuit of size a multiple of n and which is updated in parallel. - Mathilde Noual (mathilde.noual(AT)ens-lyon.fr), Feb 25 2009Also, the number of periodic points with (minimal) period n in the iteration of the tent map f(x):=2min{x,1-x} on the unit interval. - _Pietro Majer_, Sep 22 2009Number of distinct cycles of minimal period n in a shift dynamical system associated with a totally disconnected hyperbolic iterated function system (see Barnsley link). - _Michel Marcus_, Oct 06 2013From _Jean-Christophe Hervé_, Oct 26 2014: (Start)For n > 0, a(n) is also the number of orbits of size n of the transform associated to the Oldenburger-Kolakoski sequence A000002 (and this is true for any map with 2^n periodic points of period n). The Oldenburger-Kolakoski transform changes a sequence of 1's and 2's by the sequence of the lengths of its runs. The Oldenburger-Kolakoski sequence is one of the two fixed points of this transform, the other being the same sequence without the initial term. A025142 and A025143 are the periodic points of the orbit of size 2. A027375(n) = n*a(n) gives the number of periodic points of minimal period n.For n > 1, this sequence is equal to A059966 and to A060477, and for n = 1, a(1) = A059966(1)+1 = A060477(1)-1; this because the n-th term of all 3 sequences is equal to (1/n)*sum_{d|n} mu(n/d)*(2^d+e), with e = -1/0/1 for resp. A059966/this sequence/A060477, and sum_{d|n} mu(n/d) equals 1 for n = 1 and 0 for all n > 1. (End)Warning: A000031 and A001037 are easily confused, since they have similar formulas.","references":["Michael F. Barnsley, Fractals Everywhere, Academic Press, San Diego, 1988, page 171 lemma 3.","E. R. Berlekamp, Algebraic Coding Theory, McGraw-Hill, NY, 1968, p. 84.","E. L. Blanton, Jr., S. P. Hurd and J. S. McCranie. On the digraph defined by squaring mod m, when m has primitive roots. Congr. Numer. 82 (1991), 167-177.","P. J. Freyd and A. Scedrov, Categories, Allegories, North-Holland, Amsterdam, 1990. See 1.925.","M. Lothaire, Combinatorics on Words, Addison-Wesley, Reading, MA, 1983, pp. 65, 79.","Guy Melancon, Factorizing infinite words using Maple, MapleTech Journal, vol. 4, no. 1, 1997, pp. 34-42, esp. p. 36.","M. R. Nester, (1999). Mathematical investigations of some plant interaction designs. PhD Thesis. University of Queensland, Brisbane, Australia.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence in entries N0046 and N0287).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["T. D. Noe, <a href=\"/A001037/b001037.txt\">Table of n, a(n) for n = 0..200</a>","Joerg Arndt, <a href=\"http://www.jjj.de/fxt/#fxtbook\">Matters Computational (The Fxtbook)</a>, pp.379-383, pp.843-845","E. L. Blanton, Jr., S. P. Hurd and J. S. McCranie, <a href=\"http://www.fq.math.ca/Scanned/30-4/blanton.pdf\">On a digraph defined by squaring modulo n</a>, Fibonacci Quart. 30 (1992), 322-333.","P. J. Cameron, <a href=\"http://www.cs.uwaterloo.ca/journals/JIS/VOL3/groups.html\">Sequences realized by oligomorphic permutation groups</a>, J. Integ. Seqs. Vol. 3 (2000), #00.1.5.","R. Church, <a href=\"http://www.jstor.org/stable/1968675\">Tables of irreducible polynomials for the first four prime moduli</a>, Annals Math., 36 (1935), 198-209.","J. Demongeot, M. Noual and S. Sene, <a href=\"http://dx.doi.org/10.1109/WAINA.2010.141\">On the number of attractors of positive and negative threshold Boolean automata circuits</a>, 2010 IEEE 24th Intl. Conf. Advan. Inf. Network. Appl.  Workshops (WAINA), p 782-789","Bau-Sen Du, <a href=\"http://arXiv.org/abs/0706.2297\">The Minimal Number of Periodic Orbits of Periods Guaranteed in Sharkovskii's Theorem</a>. Bull. Austral. Math. Soc. 31(1985), 89-103. Corrigendum: 32 (1985), 159.","S. V, Duzhin, D. V. Pasechnik, <a href=\"ftp://pdmi.ras.ru/pub/publicat/znsl/v421/p081.pdf\">Groups acting on necklaces and sandpile groups</a>, 2014. See page 85. - _N. J. A. Sloane_, Jun 30 2014","E. N. Gilbert and J. Riordan, <a href=\"http://projecteuclid.org/euclid.ijm/1255631587\">Symmetry types of periodic sequences</a>, Illinois J. Math., 5 (1961), 657-665.","M. A. Harrison, <a href=\"http://www.jstor.org/stable/2946369\">On the classification of Boolean functions by the general linear and affine groups</a>, J. Soc. Indust. Appl. Math. 12 (1964) 285-299.","A. Knopfmacher, M. E. Mays, <a href=\"http://www.emis.de/journals/INTEGERS/papers/b4/b4.Abstract.html\">Graph Compositions I: Basic enumeration</a>, Integers 1 (2001), A4, eq. (1).","T. Laarhoven and B de Weger, <a href=\"http://arxiv.org/abs/1209.3495\">The Collatz conjecture and De Bruijn graphs</a>, arXiv preprint arXiv:1209.3495 [math.NT], 2012. - From _N. J. A. Sloane_, Dec 27 2012","J. C. Lagarias, <a href=\"http://matwbn.icm.edu.pl/ksiazki/aa/aa56/aa5614.pdf\">The set of rational cycles for the 3x+1 problem</a>, Acta Arithmetica, LVI (1990), pp. 33-53.","R. J. Mathar, <a href=\"http://arxiv.org/abs/0903.2514\">Hardy-Littlewood constants embedded into infinite products over all positive integers</a>, sequence gamma_{2,j}^(T), arXiv:0903.2514 [math.NT], 2009-2011.","Ueli M. Maurer, <a href=\"http://dx.doi.org/10.1016/0166-218X(92)90149-5\">Asymptotically-tight bounds on the number of cycles in generalized de Bruijn-Good graphs</a>, Discrete applied mathematics 37 (1992): 421-436. See Table 1.","H. Meyn and W. Götz, <a href=\"http://www.mat.univie.ac.at/~slc/opapers/s21meyn.html\">Self-reciprocal polynomials over finite fields</a>","Mathilde Noual, <a href=\"http://dx.doi.org/10.1007/978-3-642-28332-1_37\">Dynamics of Circuits and Intersecting Circuits</a>, in Language and Automata Theory and Applications, Lecture Notes in Computer Science, 2012, Volume 7183/2012, 433-444, <a href=\"http://arxiv.org/abs/1011.3930\">ArXiv 1011.3930</a> [cs.DM]. - _N. J. A. Sloane_, Jul 07 2012","George Petrides and Johannes Mykkeltveit, <a href=\"http://dx.doi.org/10.1007/11863854_18\">On the Classification of Periodic Binary Sequences into Nonlinear Complexity Classes</a>, in Sequences and Their Applications SETA 2006, Lecture Notes in Computer Science, Volume 4086/2006, pp 209-222. [From _N. J. A. Sloane_, Jul 09 2009]","Y. Puri and T. Ward, <a href=\"http://www.cs.uwaterloo.ca/journals/JIS/VOL4/WARD/short.html\">Arithmetic and growth of periodic orbits</a>, J. Integer Seqs., Vol. 4 (2001), #01.2.1.","F. Ruskey, <a href=\"http://www.theory.cs.uvic.ca/~cos/inf/neck/NecklaceInfo.html\">Necklaces, Lyndon words, De Bruijn sequences, etc.</a>","F. Ruskey, <a href=\"http://www.theory.cs.uvic.ca/~cos/inf/neck/PolyInfo.html\">Primitive and Irreducible Polynomials</a>","Troy Vasiga and Jeffrey Shallit, <a href=\"http://dx.doi.org/10.1016/S0012-365X(03)00158-4\">On the iteration of certain quadratic maps over GF(p)</a>, Discrete Mathematics, Volume 277, Issues 1-3, 2004, pages 219-240.","G. Viennot, <a href=\"http://dx.doi.org/10.1007/BFb0067950\">Algèbres de Lie Libres et Monoïdes Libres</a>, Lecture Notes in Mathematics 691, Springer Verlag 1978.","M. Waldschmidt, <a href=\"http://www.math.jussieu.fr/~miw/articles/pdf/MZV2011IMSc.pdf\">Lectures on Multiple Zeta Values</a>, IMSC 2011.","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/IrreduciblePolynomial.html\">Irreducible Polynomial</a>","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/LyndonWord.html\">Lyndon Word</a>","Wikipedia, <a href=\"http://en.wikipedia.org/wiki/Lyndon_word\">Lyndon word</a>","<a href=\"/index/Lu#Lyndon\">Index entries for sequences related to Lyndon words</a>","<a href=\"/index/Cor#core\">Index entries for \"core\" sequences</a>"],"formula":"a(n) = (1/n) sum_{ d divides n } mu(n/d) * 2^d.A000031(n) = sum_{ d divides n } a(d).2^n = sum_{ d divides n } d*a(d).a(n) = A027375(n)/n.a(n) = A000048(n) + A051841(n).For n>1, a(n) = A059966(n) = A060477(n).G.f.: 1 - Sum_{n>=1} moebius(n)*log(1 - 2*x^n)/n, where moebius(n)=A008683(n). - _Paul D. Hanna_, Oct 13 2010","example":"Binary strings (Lyndon words, cf. A102659):a(0) = 1 = #{ \"\" },a(1) = 2 = #{ \"0\", \"1\" },a(2) = 1 = #{ \"01\" },a(3) = 2 = #{ \"001\", \"011\" },a(4) = 3 = #{ \"0001\", \"0011\", \"0111\" },a(5) = 6 = #{ \"00001\", \"00011\", \"00101\", \"00111\", \"01011\", \"01111\" }.","maple":"with(numtheory): A001037 := proc(n) local a,d; if n = 0 then RETURN(1); else a := 0: for d in divisors(n) do a := a+mobius(n/d)*2^d; od: RETURN(a/n); fi; end;","mathematica":"f[n_] := Block[{d = Divisors@ n}, Plus @@ (MoebiusMu[n/d]*2^d/n)]; Array[f, 32]","prog":"(PARI) A001037(n)=if(n>1,sumdiv(n,d,moebius(d)*2^(n/d))/n,n+1) \\\\ Edited by _M. F. Hasler_, Jan 11 2016(PARI) {a(n)=polcoeff(1-sum(k=1,n,moebius(k)/k*log(1-2*x^k+x*O(x^n))),n)} \\\\ _Paul D. Hanna_, Oct 13 2010(PARI) a(n)=if(n>1,my(s);forstep(i=2^n+1,2^(n+1),2,s+=polisirreducible(Mod(1,2) * Pol(binary(i))));s,n+1) \\\\ _Charles R Greathouse IV_, Jan 26 2012(Haskell)a001037 0 = 1a001037 n = (sum $ map (\\d -> (a000079 d) * a008683 (n `div` d)) $                       a027750_row n) `div` n-- _Reinhard Zumkeller_, Feb 01 2013","crossrefs":["Row sums of A051168, which gives the number of Lyndon words with fixed number of zeros and ones.","Euler transform is A000079.","See A058943 and A102569 for initial terms. See also A058947, A011260, A059966.","Irreducible over GF(2), GF(3), GF(4), GF(5), GF(7): A058943, A058944, A058948, A058945, A058946. Primitive irreducible over GF(2), GF(3), GF(4), GF(5), GF(7): A058947, A058949, A058952, A058950, A058951.","Cf. A000031 (n-bead necklaces but may have period dividing n), A014580, A046211, A046209, A006206-A006208, A038063, A060477, A103314.","Cf. A027750, A008683, A254040.","See also A102659 for the list of binary Lyndon words themselves."],"keyword":"nonn,core,easy,nice","offset":"0,2","author":"_N. J. A. Sloane_","extensions":["Revised by _N. J. A. Sloane_, Jun 10 2012"]}