{"formerly":"M1270 N0489","seq":"1,1,0,1,1,2,4,13,42,308,4845,227613,2653970","description":"Number of connected linear spaces with n (unlabeled) points.","comments":"Euler transform is A001200. - _Michael Somos_, Apr 24 2014In any linear space any two distinct points belong to exactly one line. A linear space is disconnected if there exists a partition of the points of the space into two subsets such that for any two distinct points in a subset of the partition the unique line they both belong to is completely contained in that subset. - _Michael Somos_, Apr 24 2014","references":["L. M. Batten and A. Beutelspacher: The theory of finite linear spaces, Cambridge Univ. Press, 1993 (see the Appendix).","Doyen, Jean; Sur le nombre d'espaces lineaires non isomorphes de n points. Bull. Soc. Math. Belg. 19 1967 421-437.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["J. Doyen, <a href=\"/A001200/a001200.pdf\">Sur le nombre d'espaces lineaires non isomorphes de n points</a> [Annotated and scanned copy]","Robillard, Pierre, <a href=\"/A001548/a001548.pdf\">On the weighted finite linear spaces</a>, Bull. Soc. Math. Belg. 22 (1970), 227-241. [Annotated and scanned copy]"],"example":"a(2) = 0 because the unique linear space on two points can be partitioned into two single point subsets which disconnects the space vacuously. a(5) = 2 because there are two connected linear spaces with 5 points: one has only one line and the other has two lines with three points that intersect in one point that belongs to no other line while the other four points belong to three lines. - _Michael Somos_, Apr 24 2014","crossrefs":["Cf. A001199, A001200, A056642."],"keyword":"nonn,hard,nice","offset":"0,6","author":"_N. J. A. Sloane_.","extensions":["More terms could be obtained from A056642. - _N. J. A. Sloane_, Jul 26 2004","a(10)-a(12) from A001200. - _Michael Somos_, Apr 24 2014"]}