{"formerly":"M1912","seq":"2,9,9,7,9,2,4,5,8","description":"Decimal expansion of the speed of light in vacuum in SI units, 299792458 meters/second.","comments":"Since 1983, the speed of light has been defined to be exactly 299792458 m/s.From _Stanislav Sykora_, Jun 16 2012: (Start)General context: Within current metrological systems (SI + IAU definitions), several physics constants have been \"assigned\" immutable values. They thus became metrological reference points, no longer subject to experimental assessment. These should not be confused with \"conventional\" values of some empirical quantities (such as Josephson’s constant) used in applied metrology, but not assigned, and therefore subject to possible future revisions.Assigned metrological constants and some of their combinations that appear in the OEIS include the speed of light (this sequence) and its square, cube, and 4th power (A182999, A183000, and A183001, respectively); magnetic permeability of vacuum (A019694); electric permittivity of vacuum (A081799); characteristic impedance of vacuum (A213610); standard gravity acceleration (A072915), standard atmosphere (A213611), Julian year (A213612), Gregorian year (A213613) and the light-year (A213614), all in basic SI units.(End)Prime factors of this number are: 2^1, 7^1, 73^1, 293339^1. - _John W. Nicholson_, Jun 15 2014","references":["CRC Handbook for Chemistry and Physics, 75th edition, (1994-1995), Page 1-1.","H. J. Fischbeck and K. Fischbeck, Formulas. Facts and Constants, Springer-Verlag, NY, 2nd ed., 1987.","R. F. Fox and T. P. Hill, An exact value for Avogadro's number, American Scientist, 95 (No. 2, 2007), 104-107.","K. R. Lang, Astrophysical Data: Planets and Stars, Springer-Verlag, NY, 1991.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["BIPM, <a href=\"http://www1.bipm.org/\">Bureau International des Poids et Mesures</a>, the historic home of SI units (works jointly with NIST).","G. Bonnet, <a href=\"http://culturesciencesphysique.ens-lyon.fr/Entree_par_theme/generalites/VLumiere\">La vitesse de la lumiere (Text in French)</a>.","IAU, <a href=\"http://www.iau.org/\">International Astronomical Union</a> has accepted SI and added a few definitions of its own.","P. J. Mohr, B. N. Taylor and D. B. Newell, <a href=\"http://dx.doi.org/10.1103/RevModPhys.80.633\">CODATA recommended values of the fundamental physical constants: 2006, Rev.Mod.Phys. 80, 2008, 633-730. DOI: 10.1103/RevModPhys.80.633</a>. (This is the hard-core source of what became CODATA 2010.)","NIST, <a href=\"http://physics.nist.gov/cuu/Constants/\">CODATA Fundamental Physical Constants</a>.","S. Sykora, <a href=\"http://www.ebyte.it/library/educards/constants/ConstantsOfPhysicsAndMath.html\">Constants of Physics and Mathematics</a>, extensive constant-at-a-glance tables.","Eric Weisstein, World of Physics, <a href=\"http://scienceworld.wolfram.com/physics/SpeedofLight.html\">Speed of Light</a>.","Wikipedia, <a href=\"http://en.wikipedia.org/wiki/Speed_of_light\">Speed of light</a>."],"example":"c = 299792458 meters/second (equals 299792.458 kilometers/second).","crossrefs":["Cf. A224236, A224237, A224238, A070058, A070059, A070060, A070062, A070063, A070064.","More assigned constants: A182999, A019694, A081799, A213610, A072915, A213611, A213612, A213613, A213614."],"keyword":"cons,nonn,fini,full","offset":"9,1","author":"_N. J. A. Sloane_.","extensions":["Additional comments from Ron Marcinski (ronmarcinski(AT)hotmail.com), Apr 18 2002"]}