{"formerly":"M5374","seq":"1,120,210,1540,3003,7140,11628,24310,61218182743304701891431482520","description":"Numbers that occur 5 or more times in Pascal's triangle.","comments":"The subject of a recent thread on sci.math. Apparently it has been known for many years that there are infinitely many numbers that occur at least 6 times in Pascal's triangle, namely the solutions to {n choose m-1} = {n-1 choose m} given by n = F_{2k}F_{2k+1}; m = F_{2k-1}F_{2k} where F_i is the i-th Fibonacci number. The first of these outside the range of the existing database entry is {104 choose 39} = {103 choose 40}= 61218182743304701891431482520. - _Christopher E. Thompson_, Mar 09 2001It may be that there are no terms that appear exactly 5 times in Pascal's triangle, in which case the title could be changed to \"Numbers that occur 6 or more times in Pascal's triangle\". - _N. J. A. Sloane_, Nov 24 2004No other terms below 33*10^16 (_David W. Wilson_).61218182743304701891431482520 really is the next term. Weger shows this and I checked it. - _T. D. Noe_, Nov 15 2004","references":["L. Comtet, Advanced Combinatorics, Reidel, 1974, p. 93, #47.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["B. M. M. de Weger, <a href=\"http://hdl.handle.net/1765/1356\">Equal binomial coefficients: some elementary considerations</a>, Econometric Institute Research Papers, No. EI 9536-/B, 1995.","B. M. M. de Weger, <a href=\"http://dx.doi.org/10.1006/jnth.1997.2109\">Equal binomial coefficients: some elementary considerations</a>, Journal of Number Theory, Volume 63, Issue 2, April 1997, Pages 373-386.","R. K. Guy and V. Klee, <a href=\"http://www.jstor.org/stable/2316321\">Monthly research problems</a>, 1969-1971, Amer. Math. Monthly, 78 (1971), 1113-1122.","David Singmaster, <a href=\"http://www.fq.math.ca/Scanned/13-4/singmaster.pdf\">Repeated binomial coefficients and Fibonacci numbers</a>, Fibonacci Quarterly 13 (1975) 295-298.","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/PascalsTriangle.html\">Pascal's Triangle</a>"],"crossrefs":["Cf. A003016, A059233.","Cf. A182237, A098565 (subsequence)."],"keyword":"nonn","offset":"1,2","author":"_N. J. A. Sloane_"}