{"formerly":"M2334","seq":"0,0,0,1,1,3,4,7,8,12,15,20","description":"Minimal number of arcs whose reversal yields a transitive tournament.","comments":"This is the \"minimum feedback arc set\" problem.The minimal number of arcs you need to delete to make a directed graph acyclic (maxed over all n-vertex directed graphs) is the same as the minimal number of arcs you need to reverse to make a tournament acyclic (maxed over all n-player tournaments).","references":["J.-C. Bermond, Ordres a` distance minimum d'un tournoi et graphs partiels sans circuits maximaux, Math. Sci. Hum., No. 37 (1972), 5-25.","Bermond, J.-C. The circuit-hypergraph of a tournament. Infinite and finite sets (Colloq., Keszthely, 1973; dedicated to P. Erdős on his 60th birthday), Vol. I, pp. 165--180. Colloq. Math. Soc. Janos Bolyai, Vol. 10, North-Holland, Amsterdam, 1975. MR0396319 (53 #187)","Don Coppersmith, Lisa Fleischer and Atri Rudra: Ordering by weighted number of wins gives a good ranking for weighted tournaments. SODA 2006: 776-782.","K. B. Reid, On sets of arcs containing no cycles in tournaments, Canad. Math. Bull., 12 (1969), 261-264.","Sanchez-Flores, Neumann-Lara and Bermond, Graphs & Combin 10 (1994) 363-366 and 367-376.","Sanchez-Flores, Neumann-Lara and Bermond, Math. Sci. Humaines 37 (1972) 5-25.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["W. D. Smith, <a href=\"http://rangevoting.org/PuzzDG.html\">Partial Answer to Puzzle #21: Getting rid of cycles in directed graphs</a> [Has much more information]","Yahoo Groups, <a href=\"http://groups.yahoo.com/group/RangeVoting/\">Range Voting</a>","<a href=\"/index/To#tournament\">Index entries for sequences related to tournaments</a>"],"formula":"The asymptotics for large n are (n+1)n/4-Cn^{3/2} <= F(n) <= (n+1)n/4-Kn^{3/2} for all sufficiently large n and certain constants C,K>0. - Warren Smith, Sep 14 2006","crossrefs":["Equals C(n, 2) - A001225.","a(n) = A182079(n) iff n <= 9, thereafter a(n) > A182079(n). [Bermond]"],"keyword":"hard,more,nonn,nice","offset":"0,6","author":"_N. J. A. Sloane_.","extensions":["Additional comments from Warren D. Smith, Sep 14 2006"]}