{"formerly":"M3406","seq":"1,4,11,16,24,29,33,35,39,45,47,51,56,58,62,64,69,73,78,80,84,89,94,99,104,111,116,122,126,131,136,142,147,158,164,169,174,181,183,193,199,205,208,214,220,226,231,237,243,249,254,270,288,303,307,319,323,341","description":"T is the first, fourth, eleventh, ... letter in this sentence, not counting spaces or commas (Aronson's sequence).","references":["A. J. Aronson, quoted by D. R. Hofstadter in Metamagical Themas, Basic Books, NY, 1985, p. 44.","James Gleick, Faster, Vintage Books, NY, 2000 (see pp. 259-261).","N. J. A. Sloane, Seven Staggering Sequences, in Homage to a Pied Puzzler, E. Pegg Jr., A. H. Schoen and T. Rodgers (editors), A. K. Peters, Wellesley, MA, 2009, pp. 93-110.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["B. Cloitre, N. J. A. Sloane and M. J. Vandermast, <a href=\"http://www.cs.uwaterloo.ca/journals/JIS/index.html\">Numerical analogues of Aronson's sequence</a>, J. Integer Seqs., Vol. 6 (2003), #03.2.2. arXiv:<a href=\"http://arXiv.org/abs/math.NT/0305308\">math.NT/0305308</a>","N. J. A. Sloane, <a href=\"http://neilsloane.com/doc/g4g7.pdf\">Seven Staggering Sequences</a>.","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/AronsonsSequence.html\">Aronson's Sequence</a>"],"example":"The sentence begins1234567890 1234567890 1234567890 1234567890 1234567890Tisthefirs tfourthele venthsixte enthtwenty fourthtwentyninththi rtythirdth irtyfiftht hirtyninth fortyfifthfortyseven thfiftyfir stfiftysix thfiftyeig hthsixtysecondsixtyf ourthsixty ninthseven tythirdsev entyeightheightiethe ightyfourt heightynin thninetyfo urthninetyninthonehu ndredfourt honehundre deleventho nehundredsixteenthon ehundredtw entysecond onehundred twentysixthonehundre dthirtyfir stonehundr edthirtysi xthonehundredfortyse cond...","crossrefs":["Cf. A049525, A055508, A081023, A081024, A079000, A097395."],"keyword":"nonn,word,nice","offset":"1,2","author":"_N. J. A. Sloane_.","extensions":["Corrected and extended by Larry Reeves (larryr(AT)acm.org), Oct 31 2000"]}