{"formerly":"M1805","seq":"1,1,2,7,40,357,4824,96428,2800472,116473461,6855780268,565505147444,64824245807684","description":"Number of partial orders on {1,2,...,n} that are contained in the usual linear order (i.e., xRy => x<y).","comments":"Also the number of n X n upper triangular Boolean matrices B with all diagonal entries 1 such that B = B^2.The asymptotic values derived by Brightwell et al. are relevant only for extremely large values of n. The average number of linear extensions (topological sorts) of a random partial order on {1,...,n} is n! S_n / N_n, where S_n is this sequence and N_n is sequence A001035","references":["S. P. Avann, The lattice of natural partial orders. Aequationes Mathematicae 8 (1972), 95-102.","Graham Brightwell, Hans Jürgen Prömel and Angelika Steger, The average number of linear extensions of a partial order. Journal of Combinatorial Theory A73 (1996), 193-206.","N. B. Hindman, personal communication.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["S. R. Finch, <a href=\"http://www.people.fas.harvard.edu/~sfinch/\">Transitive relations, topologies and partial orders</a>","Adam King, A. Laubmeier, K. Orans, A. Godbole, <a href=\"http://arxiv.org/abs/1405.5938\">Universal and Overlap Cycles for Posets, Words, and Juggling Patterns</a>, arXiv preprint arXiv:1405.5938, 2014","D. E. Knuth, <a href=\"http://www-cs-faculty.stanford.edu/~knuth/programs.html\">POSETS</a>, program for n = 10, 11, 12.","J.-G. Luque, L. Mignot and F. Nicart, <a href=\"http://arxiv.org/abs/1205.3371\">Some Combinatorial Operators in Language Theory</a>, arXiv preprint arXiv:1205.3371, 2012. - From _N. J. A. Sloane_, Oct 22 2012","<a href=\"/index/Pos#posets\">Index entries for sequences related to posets</a>"],"crossrefs":["Cf. A000112, A001035."],"keyword":"hard,more,nice,nonn","offset":"0,3","author":"_N. J. A. Sloane_","extensions":["Additional comments and more terms from _Don Knuth_, Dec 03 2001"]}