{"formerly":"M3736","seq":"1,1,1,1,5,3,60,487,13710027","description":"Number of Hadamard matrices of order 4n.","comments":"More precisely, number of inequivalent Hadamard matrices of order n if two matrices are considered equivalent if one can be obtained from the other by permuting rows, permuting columns and multiplying rows or columns by -1.The Hadamard conjecture is that a(n) > 0 for all n >= 0. - _Charles R Greathouse IV_, Oct 08 2012","references":["V. Alvarez, J. A. Armario, M. D. Frau and F. Gudlel, The maximal determinant of cocyclic (-1, 1)-matrices over D_{2t}, Linear Algebra and its Applications, 2011, in press; doi:10.1016/j.laa.2011.05.018","F. J. Aragon Artacho, J. M. Borwein, M. K. Tam, Douglas-Rachford Feasibility Methods for Matrix Completion Problems, 2013; http://www.carma.newcastle.edu.au/~jb616/DR_MatrixCompletion.pdf","J. Hadamard, Résolution d'une question relative aux déterminants, Bull. des Sciences Math. 2 (1893), 240-246.","H. Kharaghani and B. Tayfeh-Rezaie, On the classification of Hadamard matrices of order 32, J. Combin. Des., 18 (2010), 328-336.","H. Kharaghani and B. Tayfeh-Rezaie, Hadamard matrices of order 32, math.ipm.ac.ir/tayfeh-r/papersandpreprints/H32typetwo.pdf","Kimura, H., (1986), Hadamard matrices of order 28 with automorphism groups of order two, J. Combin. Theory, A 43, 98-102.","Kimura, H., (1989), New Hadamard matrix of order 24, Graphs Combin., 5, 235-242.","Kimura, H., (1994), Classification of Hadamard matrices of order 28 with Hall sets, Discrete Math., 128, 257-268.","Kimura, H., (1994), Classification of Hadamard matrices of order 28, Discrete Math., 133, 171-180.","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence).","Spence, Edward; Classification of Hadamard matrices of order 24 and 28. Discrete Math. 140 (1995), no. 1-3, 185-243.","Wolfram, S. A New Kind of Science. Champaign, IL: Wolfram Media, p. 1073, 2002."],"links":["Hadi Kharaghani, <a href=\"http://www.cs.uleth.ca/~hadi/\">Home Page</a>","Hadi Kharaghani and B. Tayfeh-Rezaie, <a href=\"http://math.ipm.ac.ir/tayfeh-r/Hadamard32.htm\">Hadamard matrices of order 32</a>, J. Combin. Designs 21 (2013) no. 5, 212-221 [<a href=\"http://dx.doi.org/10.1002/jcd.21323\">DOI</a>]","W. P. Orrick, <a href=\"http://arXiv.org/abs/math.CO/0507515\">Switching operations for Hadamard matrices</a>, arxiv:math.CO/0507515. (Gives lower bounds for a(8) and a(9))","N. J. A. Sloane, <a href=\"http://neilsloane.com/hadamard/\">Tables of Hadamard matrices</a>","N. J. A. Sloane, <a href=\"http://neilsloane.com/doc/sg.txt\">My favorite integer sequences</a>, in Sequences and their Applications (Proceedings of SETA '98).","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/HadamardMatrix.html\">Hadamard Matrix</a>","<a href=\"/index/Ha#Hadamard\">Index entries for sequences related to Hadamard matrices</a>"],"crossrefs":["Cf. A096201, A036297, A048615, A048616, A003432, A048885."],"keyword":"hard,nonn,nice","offset":"0,5","author":"_N. J. A. Sloane_","extensions":["a(8) from the H. Kharaghani and B. Tayfeh-Rezaie paper. - _N. J. A. Sloane_, Feb 11 2012"]}