{"formerly":"M0107 N0132","seq":"1,1,2,2,6,6,18,16,48,60,176,144,630,756,1800,2048,7710,7776,27594,24000,84672,120032,356960,276480,1296000,1719900,4202496,4741632,18407808,17820000,69273666,67108864,211016256","description":"Number of primitive polynomials of degree n over GF(2).","references":["E. R. Berlekamp, Algebraic Coding Theory, McGraw-Hill, NY, 1968, p. 84.","T. L. Booth, An analytical representation of signals in sequential networks, pp. 301-3240 of Proceedings of the Symposium on Mathematical Theory of Automata. New York, N.Y., 1962. Microwave Research Institute Symposia Series, Vol. XII; Polytechnic Press of Polytechnic Inst. of Brooklyn, Brooklyn, N.Y. 1963 xix+640 pp. See p. 303.","R. Church, Tables of irreducible polynomials for the first four prime moduli, Annals Math., 36 (1935), 198-209.","P. Fan and M. Darnell, Sequence Design for Communications Applications, Wiley, NY, 1996, Table 5.1, p. 118.","W. W. Peterson and E. J. Weldon, Jr., Error-Correcting Codes. MIT Press, Cambridge, MA, 2nd edition, 1972, p. 476.","M. P. Ristenblatt, Pseudo-Random Binary Coded Waveforms, pp. 274-314 of R. S. Berkowitz, editor, Modern Radar, Wiley, NY, 1965; see p. 296.","N. J. A. Sloane, A Handbook of Integer Sequences, Academic Press, 1973 (includes this sequence).","N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."],"links":["David W. Wilson, <a href=\"/A011260/b011260.txt\">Table of n, a(n) for n=1..400</a>","Joerg Arndt, <a href=\"http://www.jjj.de/fxt/#fxtbook\">Matters Computational (The Fxtbook)</a>","Karthik Ganesan, Alexander Hu, Subhasish Mitra, H.-S. Philip Wong, Simon Wong, Tony F. Wu, <a href=\"http://arxiv.org/abs/1505.02211\">TPAD: Hardware Trojan Prevention and Detection for Trusted Integrated Circuits</a>, arXiv preprint, 2015.","P. Koopman, <a href=\"http://www.cs.cmu.edu/~koopman/lfsr/index.html\">Complete lists up to N=32</a>","F. Ruskey, <a href=\"http://www.theory.cs.uvic.ca/~cos/inf/neck/PolyInfo.html\">Primitive and Irreducible Polynomials</a>","Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/PrimitivePolynomial.html\">Primitive Polynomial.</a>"],"maple":"with(numtheory): phi(2^n-1)/n;","mathematica":"Table[EulerPhi[(2^n - 1)]/n, {n, 1, 50}]","prog":"(PARI) a(n)=eulerphi(2^n-1)/n - Hauke Worpel (thebigh(AT)outgun.com), Jun 10 2008","crossrefs":["See A058947 for initial terms. Cf. A001037, A000020.","Cf. A027695."],"keyword":"nonn,easy,nice","offset":"1,3","author":"_N. J. A. Sloane_."}