{"formerly":"","seq":"1,6,19,657,21691,489489,9902523,1144421889,1683200989470,349043376293530","description":"Smallest m such that x^3+y^3=m has rank n, if m exists.","comments":"Nick Rogers (rogers(AT)fas.harvard.edu), Jul 03 2003: I have verified that the first 5 entries are correct; the first two are basically trivial and the third is due to Selmer. I'm not sure who first discovered entries 4 and 5 and I expect that they had been previously proved to be the smallest values, (cont.)but I have rechecked that they are minimal for their respective rank using a combination of 3-descent, MAGMA and John Cremona's program mwrank. (cont.)There are new smaller values for ranks 6 and 7, namely k = 9902523 has rank 6 and k = 1144421889 has rank 7. 3-descent combined with Ian Connell's package apecs for Maple verifies that these are minimal subject to the Birch and Swinnerton-Dyer conjecture and the Generalized Riemann Hypothesis for L-functions associated to elliptic curves. (cont.)Finally, there are new entries for ranks 8 and 9: k = 1683200989470 has rank 8 and k = 148975046052222390 has rank 9. It seems somewhat likely that the rank 8 example is minimal. (end.)The sequence might be finite, even if it is redefined as smallest m such that x^3+y^3=m has rank >= n. - _Jonathan Sondow_, Oct 27 2013","references":["Noam D. Elkies, Posting to Number Theory List (NMBRTHRY(AT)LISTSERV.NODAK.EDU), Oct 19 2003, for a(9)","Noam D. Elkies and Nicholas F. Rogers, Posting to Number Theory List (NMBRTHRY(AT)LISTSERV.NODAK.EDU), Jul 18 2003, for a(8) and a(9).","Troy Kessler (kesslert(AT)surfree.com), Posting to Number Theory List (NMBRTHRY(AT)LISTSERV.NODAK.EDU), Apr 22, 2001.","Nick Rogers, Rank computations for the congruent number elliptic curves. Experimental Mathematics 9 (2000), no. 4, 591-594"],"crossrefs":["Cf. A060838, A230564."],"keyword":"nonn,nice","offset":"0,2","author":"_N. J. A. Sloane_, Apr 23 2001","extensions":["Definition clarified by _Jonathan Sondow_, Oct 27 2013"]}